Autodesk.Revit.DB.InstanceNode.GetGNodeTag
Returns the GTag of the GInstance.
Since:
2014

Autodesk.Revit.DB.InstanceNode.GetSymbolGeometryId
Gets the SymbolGeometryId associated with the node.
Remarks:
Use the strings returned by SymbolGeometryId.AsIdentifier(bool) to check if two nodes point to the same geometry of the symbol.
Since:
2023

Autodesk.Revit.DB.InstanceNode
An output node that represents an instance of a geometry. It can be an instance of FamilyInstance, or it can be and instance of a part of symbol's geometry.
Remarks:
See also: Autodesk.Revit.DB.IExportContext.OnInstanceBegin(Autodesk.Revit.DB.InstanceNode).
The Autodesk.Revit.DB.SymbolGeometryId. contains the data for comparing if two InstanceNode points to the same geometry.
Since:
2014